document.getElementById("sheetsBtn").onclick = function () {

document.getElementById("contenido").innerHTML = `

<h2>Sheets</h2>

<input type="text" placeholder="Buscar plantilla...">

<hr>

<div class="sheetOption" id="femaleSheet">

♀ Female Sheet

</div>

<div class="sheetOption" id="maleSheet">

♂ Male Sheet

</div>

<div id="sheetContent"></div>

`;

};

document.addEventListener("click", function(event){

if(event.target.id=="femaleSheet"){

document.getElementById("sheetContent").innerHTML=`

<pre>

╭────── ✦ ──────╮
 ♡ 𝑬𝒏𝒅 𝒐𝒇 𝒂 𝑨𝒏𝒄𝒊𝒆𝒏𝒕 𝑬𝒓𝒂 ♡
╰────── ✦ ──────╯

୨୧ ── 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 𝐃𝐚𝐭𝐚.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗡𝗮𝗺𝗲：
╰─➤ 

✦ 𝗞𝗮𝗻𝗮：
╰─➤ 

✦ 𝗥𝗼𝗺𝗮𝗷𝗶：
╰─➤ 

✦ 𝗧. 𝗖𝗵𝗶𝗻𝗲𝘀𝗲：
╰─➤

✦ 𝗦. 𝗖𝗵𝗶𝗻𝗲𝘀𝗲：
╰─➤

✦ 𝗞𝗼𝗿𝗲𝗮𝗻：
╰─➤

✦ 𝗡𝗶𝗰𝗸𝗻𝗮𝗺𝗲𝘀：
╰─➤

✦ 𝗔𝗹𝗶𝗮𝘀：
╰─➤

❀ ────────────── ❀

୨୧ ── 𝐁𝐚𝐬𝐢𝐜 𝐈𝐧𝐟𝐨𝐫𝐦𝐚𝐭𝐢𝐨𝐧.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗚𝗲𝗻𝗱𝗲𝗿：
╰─➤

✦ 𝗛𝗲𝗶𝗴𝗵𝘁：
╰─➤

✦ 𝗪𝗲𝗶𝗴𝗵𝘁：
╰─➤

✦ 𝗦𝗶𝘇𝗲𝘀：
╰─➤

✦ 𝗕𝗶𝗿𝘁𝗵𝗱𝗮𝘆：
╰─➤

✦ 𝗕𝗶𝗿𝘁𝗵𝗽𝗹𝗮𝗰𝗲：
╰─➤

❀ ────────────── ❀

୨୧ ── 𝐑𝐚𝐜𝐞𝐫 𝐎𝐯𝐞𝐫𝐯𝐢𝐞𝐰.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗧𝗲𝗮𝗺：
╰─➤

✦ 𝗢𝗰𝗰𝘂𝗽𝗮𝘁𝗶𝗼𝗻：
╰─➤

✦ 𝗔𝗳𝗳𝗶𝗹𝗶𝗮𝘁𝗶𝗼𝗻：
╰─➤

❀ ────────────── ❀

୨୧ ── 𝐏𝐫𝐨𝐟𝐢𝐥𝐞 𝐚𝐧𝐝 𝐒𝐮𝐦𝐦𝐚𝐫𝐲.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

⟣───────────────⟢

⋆｡ﾟ☁｡⋆｡ ﾟ☾ ﾟ｡⋆
───

❀ ────────────── ❀

୨୧ ── 𝐂𝐡𝐚𝐫𝐚𝐜𝐭𝐞𝐫 𝐃𝐞𝐭𝐚𝐢𝐥𝐬.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹𝗶𝘁𝘆：
╰─➤

✦ 𝗟𝗶𝗸𝗲𝘀：
╰─➤

✦ 𝗗𝗶𝘀𝗹𝗶𝗸𝗲𝘀：
╰─➤

❀ ────────────── ❀

୨୧ ── 𝐕𝐢𝐬𝐮𝐚𝐥 𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗣𝗵𝘆𝘀𝗶𝗰𝗮𝗹：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗖𝗮𝘀𝘂𝗮𝗹 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗦𝘁𝗮𝗴𝗲 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗥𝗮𝗰𝗲 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

❀ ────────────── ❀

୨୧ ── 𝐑𝐞𝐥𝐚𝐭𝐢𝐨𝐧𝐬𝐡𝐢𝐩𝐬 𝐈𝐧𝐟𝐨
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗙𝗮𝗺𝗶𝗹𝘆：

⟣──────────────⟢

✧₊˚.🌟⋆☾⋆🌟.˚₊✧
───
              
⟣──────────────⟢

✦ 𝗙𝗿𝗶𝗲𝗻𝗱𝘀：

⟣──────────────⟢

✧₊˚.🌟⋆☾⋆🌟.˚₊✧
───
              
⟣──────────────⟢

❀ ────────────── ❀

୨୧ ── 𝐑𝐚𝐜𝐢𝐧𝐠 𝐚𝐧𝐝 𝐂𝐚𝐫𝐞𝐞𝐫.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗦𝘁𝘆𝗹𝗲：
╰─➤

✦ 𝗗𝗶𝘀𝘁𝗮𝗻𝗰𝗲：
╰─➤

✦ 𝗧𝗿𝗮𝗰𝗸 𝗔𝗽𝘁𝗶𝘁𝘂𝗱𝗲：
╰─➤

✦ 𝗭𝗼𝗻𝗲：
╰─➤

❀ ────────────── ❀

୨୧ ── 𝐀𝐝𝐝𝐢𝐭𝐢𝐨𝐧𝐚𝐥 𝐄𝐧𝐭𝐫𝐲.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗦𝗲𝗰𝗿𝗲𝘁𝘀：

⟣──────────────⟢

✧･ﾟ: ✧･ﾟ:💥:･ﾟ✧:･ﾟ✧
───
              
⟣──────────────⟢

✦ 𝗖𝘂𝗿𝗶𝗼𝘀𝗶𝘁𝗶𝗲𝘀：

⟣──────────────⟢

✧･ﾟ: ✧･ﾟ:💥:･ﾟ✧:･ﾟ✧
───
              
⟣──────────────⟢

╭─────────────────────╮
୨♡୧── ⟨𝑫𝒂𝒘𝒏 𝒐𝒇 𝒂 𝑵𝒆𝒘 𝑫𝒂𝒚⟩ ──୨♡୧
╰─────────────────────╯

</pre>

`;

}

if(event.target.id=="maleSheet"){

document.getElementById("sheetContent").innerHTML=`

<pre>

╭────── ✦ ──────╮
 ✧ 𝑬𝒏𝒅 𝒐𝒇 𝒂 𝑨𝒏𝒄𝒊𝒆𝒏𝒕 𝑬𝒓𝒂 ✧
╰────── ✦ ──────╯

◇ ── 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 𝐃𝐚𝐭𝐚.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗡𝗮𝗺𝗲：
╰─➤ 

✦ 𝗞𝗮𝗻𝗮：
╰─➤ 

✦ 𝗥𝗼𝗺𝗮𝗷𝗶：
╰─➤ 

✦ 𝗧. 𝗖𝗵𝗶𝗻𝗲𝘀𝗲：
╰─➤

✦ 𝗦. 𝗖𝗵𝗶𝗻𝗲𝘀𝗲：
╰─➤

✦ 𝗞𝗼𝗿𝗲𝗮𝗻：
╰─➤

✦ 𝗡𝗶𝗰𝗸𝗻𝗮𝗺𝗲𝘀：
╰─➤

✦ 𝗔𝗹𝗶𝗮𝘀：
╰─➤

✶ ────────────── ✶

◇ ── 𝐁𝐚𝐬𝐢𝐜 𝐈𝐧𝐟𝐨𝐫𝐦𝐚𝐭𝐢𝐨𝐧.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗚𝗲𝗻𝗱𝗲𝗿：
╰─➤

✦ 𝗛𝗲𝗶𝗴𝗵𝘁：
╰─➤

✦ 𝗪𝗲𝗶𝗴𝗵𝘁：
╰─➤

✦ 𝗕𝗶𝗿𝘁𝗵𝗱𝗮𝘆：
╰─➤

✦ 𝗕𝗶𝗿𝘁𝗵𝗽𝗹𝗮𝗰𝗲：
╰─➤

✶ ────────────── ✶

◇ ── 𝐑𝐚𝐜𝐞𝐫 𝐎𝐯𝐞𝐫𝐯𝐢𝐞𝐰.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗧𝗲𝗮𝗺：
╰─➤

✦ 𝗢𝗰𝗰𝘂𝗽𝗮𝘁𝗶𝗼𝗻：
╰─➤

✦ 𝗔𝗳𝗳𝗶𝗹𝗶𝗮𝘁𝗶𝗼𝗻：
╰─➤

✶ ────────────── ✶

◇ ── 𝐏𝐫𝐨𝐟𝐢𝐥𝐞 𝐚𝐧𝐝 𝐒𝐮𝐦𝐦𝐚𝐫𝐲.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

⟣───────────────⟢

⋆｡ﾟ☁｡⋆｡ ﾟ☾ ﾟ｡⋆
───

✶ ────────────── ✶

◇ ── 𝐂𝐡𝐚𝐫𝐚𝐜𝐭𝐞𝐫 𝐃𝐞𝐭𝐚𝐢𝐥𝐬.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹𝗶𝘁𝘆：
╰─➤

✦ 𝗟𝗶𝗸𝗲𝘀：
╰─➤

✦ 𝗗𝗶𝘀𝗹𝗶𝗸𝗲𝘀：
╰─➤

✶ ────────────── ✶

◇ ── 𝐕𝐢𝐬𝐮𝐚𝐥 𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗣𝗵𝘆𝘀𝗶𝗰𝗮𝗹：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗖𝗮𝘀𝘂𝗮𝗹 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗦𝘁𝗮𝗴𝗲 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✦ 𝗥𝗮𝗰𝗲 𝗖𝗹𝗼𝘁𝗵𝗲𝘀：

⟣──────────────⟢

☾ ⋆｡ﾟ✧｡✨｡✧ﾟ｡⋆ ☽
───
              
⟣──────────────⟢

✶ ────────────── ✶

◇ ── 𝐑𝐞𝐥𝐚𝐭𝐢𝐨𝐧𝐬𝐡𝐢𝐩𝐬 𝐈𝐧𝐟𝐨
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗙𝗮𝗺𝗶𝗹𝘆：

⟣──────────────⟢

✧₊˚.🌟⋆☾⋆🌟.˚₊✧
───
              
⟣──────────────⟢

✦ 𝗙𝗿𝗶𝗲𝗻𝗱𝘀：

⟣──────────────⟢

✧₊˚.🌟⋆☾⋆🌟.˚₊✧
───
              
⟣──────────────⟢

✶ ────────────── ✶

◇ ── 𝐑𝐚𝐜𝐢𝐧𝐠 𝐚𝐧𝐝 𝐂𝐚𝐫𝐞𝐞𝐫.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗦𝘁𝘆𝗹𝗲：
╰─➤

✦ 𝗗𝗶𝘀𝘁𝗮𝗻𝗰𝗲：
╰─➤

✦ 𝗧𝗿𝗮𝗰𝗸 𝗔𝗽𝘁𝗶𝘁𝘂𝗱𝗲：
╰─➤

✦ 𝗭𝗼𝗻𝗲：
╰─➤

✶ ────────────── ✶

◇ ── 𝐀𝐝𝐝𝐢𝐭𝐢𝐨𝐧𝐚𝐥 𝐄𝐧𝐭𝐫𝐲.
▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂

✦ 𝗦𝗲𝗰𝗿𝗲𝘁𝘀：

⟣──────────────⟢

✧･ﾟ: ✧･ﾟ:💥:･ﾟ✧:･ﾟ✧
───
              
⟣──────────────⟢

✦ 𝗖𝘂𝗿𝗶𝗼𝘀𝗶𝘁𝗶𝗲𝘀：

⟣──────────────⟢

✧･ﾟ: ✧･ﾟ:💥:･ﾟ✧:･ﾟ✧
───
              
⟣──────────────⟢

╭─────────────────────╮
⦅˚₊✧── ⟨𝑫𝒂𝒘𝒏 𝒐𝒇 𝒂 𝑵𝒆𝒘 𝑫𝒂𝒚⟩ ──✧₊˚⦆
╰─────────────────────╯

</pre>

`;

}

});
                          
document.getElementById("umasBtn").onclick = function () {

document.getElementById("contenido").innerHTML = `
<h2>Umas</h2>

<input type="text" placeholder="Buscar Uma...">

<p>Aquí aparecerán los personajes.</p>
`;

};

document.getElementById("racesBtn").onclick = function () {

document.getElementById("contenido").innerHTML = `
<h2>Races</h2>

<input type="text" placeholder="Buscar carrera...">

<p>Aquí aparecerán las carreras.</p>
`;

};
